# Вычислить число pi c заданной точностью d
import math
print(round(math.pi, int(input('Введите количество знаков после запятой:'))))